common-services/src/test/resources/com/osa/parsers/mockSoapTrips.xml

<?xml version="1.0" encoding="UTF-8" ?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <SOAP-ENV:Body>
        <trip xmlns="http://spring.io/guides/gs-producing-web-service">
            <from>
                <id>5029718297239237632</id>
                <code>32598600</code>
                <name>XqtTcgFLH</name>
                <city>
                    <id>272527305390657536</id>
                    <name>GTfrqNfxujaZM</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>Ethiopia</name>
                        <code>ET</code>
                    </country>
                </city>
                <country>
                    <name>Uzbekistan</name>
                    <code>UZ</code>
                </country>
            </from>
            <to>
                <id>9071534896823238656</id>
                <code>06679104</code>
                <name>YdcpiSikkcWSjFc</name>
                <city>
                    <id>8011814846167048192</id>
                    <name>gPmuKmzaEND</name>
                    <cityClass>A</cityClass>
                    <country>
                        <name>British Indian Ocean Territory</name>
                        <code>IO</code>
                    </country>
                </city>
                <country>
                    <name>Marshall Islands</name>
                    <code>MH</code>
                </country>
            </to>
            <item>
                <id>6395794085701040128</id>
                <departure>
                    <timestamp>1494626400</timestamp>
                    <timezone>Europe/Tirane</timezone>
                </departure>
                <arrival>
                    <timestamp>1494709199</timestamp>
                    <timezone>Europe/Athens</timezone>
                </arrival>
                <price>99.97</price>
                <transfer>
                    <departure>
                        <timestamp>1494641454</timestamp>
                        <timezone>Europe/Busingen</timezone>
                    </departure>
                    <arrival>
                        <timestamp>1494660385</timestamp>
                        <timezone>Europe/Monaco</timezone>
                    </arrival>
                    <station>
                        <id>730848414536402944</id>
                        <code>50232443</code>
                        <name>DpWBNEMNJuMjtLF</name>
                        <city>
                            <id>3059012232361638912</id>
                            <name>fMgpfWKF</name>
                            <cityClass>A</cityClass>
                            <country>
                                <name>Central African Republic</name>
                                <code>CF</code>
                            </country>
                        </city>
                        <country>
                            <name>Poland</name>
                            <code>PL</code>
                        </country>
                    </station>
                </transfer>
                <transfer>
                    <departure>
                        <timestamp>1494661342</timestamp>
                        <timezone>Europe/Madrid</timezone>
                    </departure>
                    <arrival>
                        <timestamp>1494665155</timestamp>
                        <timezone>Europe/Sarajevo</timezone>
                    </arrival>
                    <station>
                        <id>2981323536326087680</id>
                        <code>35909535</code>
                        <name>EhuKmmeuMkdIA</name>
                        <city>
                            <id>7565485411041085440</id>
                            <name>HLrrZHezUyABC</name>
                            <cityClass>A</cityClass>
                            <country>
                                <name>Denmark</name>
                                <code>DK</code>
                            </country>
                        </city>
                        <country>
                            <name>France</name>
                            <code>FR</code>
                        </country>
                    </station>
                </transfer>
                <status>available</status>
                <link>
                    <reference>VLXoNhl</reference>
                    <url>WOeyK4bQEm7dQDd9NjacMvjN3wttgrHSrdg</url>
                </link>
                <link>
                    <reference>miUlnZk</reference>
                    <url>9x1Mv7zZNRlvIvcKvRtuQvCZ3WWkYFM9KdV</url>
                </link>
                <link>
                    <reference>txuAXYs</reference>
                    <url>Wrd00Wu8GEgDfQZgDEl3BT3xIWRbrgesscV</url>
                </link>
            </item>
            <item>
                <id>623674296300036096</id>
                <departure>
                    <timestamp>1494626400</timestamp>
                    <timezone>Europe/Malta</timezone>
                </departure>
                <arrival>
                    <timestamp>1494709199</timestamp>
                    <timezone>Europe/Sofia</timezone>
                </arrival>
                <price>85.45</price>
                <status>partially</status>
                <link>
                    <reference>HtzHYVP</reference>
                    <url>SeDOXOodbIEfvlLKoFQztqyb8w9ve455SMW</url>
                </link>
                <link>
                    <reference>fWIMHKQ</reference>
                    <url>KydF8VhR8soBO21DYR3OYpX7oLY8RjmDN7d</url>
                </link>
                <link>
                    <reference>TKrxjXE</reference>
                    <url>7LmUfMCMMPjlSQiQ8ruZJHXiB6menshUChb</url>
                </link>
            </item>
            <item>
                <id>2095023711774647296</id>
                <departure>
                    <timestamp>1494626400</timestamp>
                    <timezone>Europe/Gibraltar</timezone>
                </departure>
                <arrival>
                    <timestamp>1494709199</timestamp>
                    <timezone>Europe/Volgograd</timezone>
                </arrival>
                <price>35.89</price>
                <status>available</status>
                <link>
                    <reference>ZnHwmgC</reference>
                    <url>PpjwJsBwKVVFlpxqZzFVPi4m2bhZ3WoAG5o</url>
                </link>
                <link>
                    <reference>jyvAGHK</reference>
                    <url>gbQreE0No3VI0FxTiPZ0iexuoLWz2iBUAdR</url>
                </link>
                <link>
                    <reference>OvdAtfC</reference>
                    <url>GajVXCMwAhd8I6xlEsG2ceAaFL6LjAyFoPr</url>
                </link>
            </item>
        </trip>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>